<h3> Data Frame Understanding </h3>

In [3]:
a=5
b=5
a+b

10

<h3> Calc Average </h3>

Create a function named calc average which takes number of parameters and gives us the average of the numbers

In [4]:
def cacl_average(*args):
    args=list(args)
    return sum(args)/len(args)

cacl_average(1,2,3,45)

12.75

<h3> Data Frame Understanding Main </h3>

In [10]:
import pandas as pd

student_data=pd.DataFrame(columns=['SN','Name','Score'])
student_data['SN']=[1,2,3,4,5,6,7,8,9,10]
student_data['Name']=['A','B','A','B','A','B','A','B','A','B']
student_data['Score']=[1,2,3,4,5,6,7,8,9,10]
student_data['New_Column']=[1,2,3,4,5,6,7,8,9,10]
display(student_data)

   SN Name  Score  New_Column
0   1    A      1           1
1   2    B      2           2
2   3    A      3           3
3   4    B      4           4
4   5    A      5           5
5   6    B      6           6
6   7    A      7           7
7   8    B      8           8
8   9    A      9           9
9  10    B     10          10

<h3> Class Examination </h3>
<ol>
    <li> Take N from users (N= total sutdents) </li>
    <li> Take students Name and Score upto n times for n different students </li>
    <li> Create a DataFrame comprising of 3 columns SN, Name, Score </li>
    <li> Create a new column named pass_status, display pass if score >32 else Fail </li>
</ol>

In [16]:
N=int(input('Enter how many students: '))
SN=[i for i in range(1,N+1)]
names=[]
scores=[]

for i in range(N):
    names.append(input('Enter Student Name: '))
    scores.append(input("Enter Student Score: "))

student_data=pd.DataFrame()
student_data['Name']=names
student_data['Scores']=scores
display(student_data)

     Name Scores
0    Rama     32
1  Prabha     42

In [12]:
pd.DataFrame({'Name': ['Ram','Sita','Hari'],
              'Score': [10,20,30]})

   Name  Score
0   Ram     10
1  Sita     20
2  Hari     30

<h3> LOC </h3>

In [34]:
import pandas as pd
from timeit import default_timer as timer
data_frame_new=pd.DataFrame({'Name': ['S','A','D','D','E','F','G'],
                             'Marks': [10,20,30,40,50,60,70]
                             })

start_time = timer()
print(start_time)
marks_column_list=data_frame_new['Marks'].tolist()
name_column_list=data_frame_new['Name'].tolist()
failed_students=[]

for indx in range(len(marks_column_list)):
    if marks_column_list[indx]<32:
        failed_students.append(name_column_list[indx])

end_time=timer()
print(f'total time taken {end_time-start_time}')
print(failed_students)

# data_frame_new

3030.044086308
total time taken 0.000497795000228507
['S', 'A', 'D']

In [32]:
import pandas as pd
from timeit import default_timer as timer
data_frame_new=pd.DataFrame({'Name': ['S','A','D','D','E','F','G'],
                             'Marks': [10,20,30,40,50,60,70]
                             })

start_time=timer()
#Solution 1
# data_frame_new=data_frame_new.loc[data_frame_new['Name']!='A']
# display(data_frame_new.loc[(data_frame_new['Marks']<32)])

#Solution 2
display(data_frame_new.loc[(data_frame_new['Marks']<32) & (data_frame_new['Name']!='A')])
end_time=timer()

print(end_time-start_time)

  Name  Marks
0    S     10
2    D     30

0.004249844000241865

<h3>ILOC </h3>

In [40]:
display(data_frame_new)
display(data_frame_new.iloc[0])
display(data_frame_new.shape)

  Name  Marks
0    S     10
1    A     20
2    D     30
3    D     40
4    E     50
5    F     60
6    G     70

Name      S
Marks    10
Name: 0, dtype: object

(7, 2)

<h3> Task </h3>
Create a quiz game. Which basically as following features

create_questions() -> This function is reponsible for creating N number of questions with 4 options available and correct answer provided as well, returns dataframe with N rows, 6 columns ['question','option 1''option 2''option 3''option 4','correct_option']


ask_questions() -> Use the dataframe generated and serially show the question row wise, and wait for user to give the answer if the answer is correct move to next question else terminate right away

In [51]:
def create_questions(): 
    N=int(input('Enter number of questions to ask: '))
    questions=[]
    option_1=[]
    option_2=[]
    option_3=[]
    option_4=[]
    correct_answers=[]
    for i in range(N):
        questions.append(input(f'Enter {i+1} question: '))
        option_1.append(input('Option 1: '))
        option_2.append(input('Option 2: '))
        option_3.append(input('Option 3: '))
        option_4.append(input('Option 4: '))
        correct_answers.append(input('Correct Option: '))
    
    question_dataframe=pd.DataFrame()
    question_dataframe['Questions']=questions
    question_dataframe['Option 1']=option_1
    question_dataframe['Option 2']=option_2
    question_dataframe['Option 3']=option_3
    question_dataframe['Option 4']=option_4
    question_dataframe['Correct Option']=correct_answers
    return question_dataframe    
    



data_frame_obtained=create_questions() #data_frame_obtained will have the returned dataframe
display(data_frame_obtained)

,Questions,Option 1,Option 2,Option 3,Option 4,Correct Option
0,Enter Capital City of Nepal,KTM,Pokhara,Daang,Charikot,1

In [56]:
def ask_questions(data_frame_questions):
    total_loop=data_frame_questions.shape[0]
    for i in range(total_loop):
        current_row=data_frame_questions.iloc[i]
        print(current_row['Questions'])
        print(current_row['Option 1'])
        print(current_row['Option 2'])
        print(current_row['Option 3'])
        print(current_row['Option 4'])
        user_input=input('Enter correct option: ')
        if user_input!=current_row['Correct Option']:
            print('Sorry Wrong Answer')
            break
        
ask_questions(data_frame_obtained)#Should take the dataframe obtained and basically run inside that single function

Enter Capital City of Nepal
KTM
Pokhara
Daang
Charikot
Sorry Wrong Answer

<h3> Apply and Sort</h3>

In [4]:
import pandas as pd

def fix_names(X):
    X=X.replace('S','P')
    X=X.replace('s','p')
    X=X.replace('$','s')
    return X


data_frame=pd.DataFrame({
    'Name': ['Sra$hant','Sradis','Srati$tha'],
    'Marks': [20,30,40]
})

print('Before apply: ')
display(data_frame)

data_frame['Name']=data_frame['Name'].apply(fix_names)

print('After Apply: ')
display(data_frame)

Before apply:

        Name  Marks
0   Sra$hant     20
1     Sradis     30
2  Srati$tha     40

After Apply:

        Name  Marks
0   Prashant     20
1     Pradip     30
2  Pratistha     40

In [6]:
print('Before Sorting: ')
display(data_frame)

data_frame=data_frame.sort_values(by='Marks',ascending=False)

print('After Sorting: ')
display(data_frame)

Before Sorting:

        Name  Marks
0   Prashant     20
1     Pradip     30
2  Pratistha     40

After Sorting:

        Name  Marks
2  Pratistha     40
1     Pradip     30
0   Prashant     20

In [11]:
N=int(input('Enter how many students: '))
students=[]
marks=[]
for i in range(N):
    students.append(input(f'Enter {i}th student name: '))
    marks.append(int(input(f'Enter {i}th student marks: ')))

data_frame=pd.DataFrame()

data_frame['Name']=students
data_frame['Marks']=marks

data_frame=data_frame.sort_values(by='Marks',ascending=False)
display(data_frame)

      Name  Marks
2    Sarad     50
1  Sashank     20
0   Aakash     10

In [15]:
#Loc Method
data_frame.loc[data_frame['Name']=='Aakash','Name']='Aakshya'
data_frame

      Name  Marks
2    Sarad     50
1  Sashank     20
0  Aakshya     10

In [18]:
def hacking_students_marks(X):
    if X=='Aakshya':
        return 90
    else: 
        pass


data_frame['Marks']=data_frame['Name'].apply(hacking_students_marks)
data_frame

      Name  Marks
2    Sarad    NaN
1  Sashank    NaN
0  Aakshya   90.0

<h3> Saving and Loading Data Frames </h3>

In [19]:
N=int(input('Enter how many students: '))
students=[]
marks=[]
for i in range(N):
    students.append(input(f'Enter {i}th student name: '))
    marks.append(int(input(f'Enter {i}th student marks: ')))

data_frame=pd.DataFrame()

data_frame['Name']=students
data_frame['Marks']=marks

data_frame=data_frame.sort_values(by='Marks',ascending=False)

#how to save dataframes here 

data_frame.to_csv('database_students.csv',index=False)

In [1]:
display(data_frame)

NameError: name 'data_frame' is not defined

In [7]:
import pandas as pd

data_frame_loaded=pd.read_csv(r'/home/fm-pc-lt-233/Personal_Projects/Universal_College_Python_Data_Science/Pandas_Learning/database_students.csv')
display(data_frame_loaded)
names_students=data_frame_loaded['Name'].to_list()
marks_students=data_frame_loaded['Marks'].to_list()
display(names_students)

       Name  Marks
0    Aakash     70
1  Prashant     50

['Aakash', 'Prashant']

In the previous KBC Task, start with choice as: 
1. Enter questions or add questions 
2. Play the Game 

if 1 is chosen: <br>
    create_question() 
    at the end of create_question() save the dataframe as csv file <br><br>
<hr>
elif 2 is chosen: <br>
    load the saved csv file and ask those questions 

<hr>

program should terminate after creating question and after playing the game

In [9]:
import pandas as pd
try:
    data_frame=pd.read_csv('Save_navako_csv.csv')
except:
    data_frame=pd.DataFrame(columns=['Name','Marks`'])

display(data_frame)

Empty DataFrame
Columns: [Name, Marks`]
Index: []